---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LinePatternSegment Properties
LinePatternSegment Class See Also Send Feedback
---

The LinePatternSegment type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Length | Gets and sets the length of the segment. |
|  | Type | Gets and sets the type of the segment. |

# See Also

LinePatternSegment Class

Autodesk.Revit.DB Namespace